tutorials/incompressible/pimpleDyMFoam/mixerGgi3D/0_orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    impellerWall
    {
        type            zeroGradient;
    }
    baffleWall
    {
        type            zeroGradient;
    }
    insideSlider
    {
        type            ggi;
        value           uniform 0;
    }
    outsideSlider
    {
        type            ggi;
        value           uniform 0;
    }
    defaultFaces
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
